taskt/Core/Automation/Commands/UIAutomationGroup/IUIElementUIElementActionSomewayProperties.dot
digraph "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementUIElementActionSomewayProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementUIElementActionSomewayProperties" [ label="IUIElementUIElementActionSomewayProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IHaveDataTableElements" [ label="IHaveDataTableElements", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementUIElementActionSomewayProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementUIElementActionSomewayProperties" -> "taskt.Core.Automation.Commands.IHaveDataTableElements";
}
